#include <stdio.h>   // бібліотека для введення/виведення
#include <math.h>    // бібліотека для математичних функцій

// головна функція програми
int main() {

    // оголошення змінних
    double x, y;

    // введення значення x з клавіатури
    printf("Enter x: ");
    scanf("%lf", &x);
//scanf — зчитує число з клавіатури:
//%lf означає тип double
//&x — адреса змінної, куди записати значення

    // обчислення значення функції
    /* формула:
       y = x^3 - 4x^2 - 5x + 9 + cos(x)
    */
    y = pow(x, 3) - 4 * pow(x, 2) - 5 * x + 9 + cos(x);

    // виведення результату
    printf("x = %.2lf\n", x);
    printf("y = %.2lf\n", y);

    return 0; // завершення програми
}