#include <stdio.h>
#include <stdlib.h>
#include <time.h>

//  безпечне введення int
int inputInt() {
    int x;
    while (scanf("%d", &x) != 1) {
        printf("Помилка! Введіть ціле число: ");
        while (getchar() != '\n'); // очищаємо буфер вводу
    }
    return x;
}

//  генерація випадкового числа [-100; 100]
int randRange() {
    return rand() % 201 - 100; // Генеруємо число від 0 до 200, потім віднімаємо 100, щоб отримати діапазон [-100; 100]
}

//  створення матриці
int** createMatrix(int n) { //Виділяється пам’ять у 2 етапи динамічна матриця
    int **a = (int**)malloc(n * sizeof(int*)); // Виділяємо память для массива указателей на строки
    for (int i = 0; i < n; i++) {
        a[i] = (int*)malloc(n * sizeof(int)); // Виділяємо память для каждой строки
    }
    return a;
}

//  заповнення матриці випадковими числами
void fillMatrix(int **a, int n) { // Проходимо по каждому элементу матриці и заполняем его случайным числом
    for (int i = 0; i < n; i++) {
        for (int j = 0; j < n; j++) {
            a[i][j] = randRange();
        }
    }
}

//  вивід матриці
void printMatrix(int **a, int n, const char *msg) { // Виводимо матрицю с сообщением
    printf("\n%s\n", msg); // Выводим сообщение перед матрицей
    for (int i = 0; i < n; i++) { //проходимо по каждой строке матрицы
        for (int j = 0; j < n; j++) {
            printf("%5d ", a[i][j]); // Выводим элемент с отступом для выравнивания
        }
        printf("\n");
    }
}

//  перетворення матриці
void transformMatrix(int **a, int n) { // Проходимо по каждому элементу матриці
    for (int i = 0; i < n; i++) {
        for (int j = 0; j < n; j++) { 

            // бічна діагональ (i + j = n - 1)
            if (i + j == n - 1) {
                a[i][j] = 0; // Встановлюємо елемент на бічній діагоналі в 0
            } 
            else {
                a[i][j] = a[i][j] * a[i][j]; // Квадрат элемента, якщо він не на бічній діагоналі
            }
        }
    }
}

//  звільнення пам’яті
void freeMatrix(int **a, int n) { // Проходимо по каждой строке и освобождаем память, затем освобождаем память для массива указателей
    for (int i = 0; i < n; i++) {
        free(a[i]); // Освобождаем память для каждой строки
    }
    free(a);
}

int main() {
    srand(time(NULL)); // Инициализируем генератор случайных чисел текущим временем

    int n;

    printf("Введіть розмір матриці n: ");
    n = inputInt();

    if (n <= 0) {
        printf("Помилка! n має бути > 0\n");
        return 1;
    }

    //  створення матриці
    int **a = createMatrix(n);

    //  заповнення
    fillMatrix(a, n);
    printMatrix(a, n, "Початкова матриця:");

    //  обробка
    transformMatrix(a, n);
    printMatrix(a, n, "Після перетворення:");

    //  звільнення пам’яті
    freeMatrix(a, n);

    return 0;
}